Обработки/Reports/_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ПоказателиДеятельностиИКвартальныеДиапазоныИхЗначений/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Показатели деятельности и квартальные диапазоны их значений",
		"0.16",
		"",
		Истина
	);
		
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция СформироватьОтчет() Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".СформироватьОтчет()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,ВариантОтчета");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ПараметрыЗаполненияМакетов = Новый Структура;
	ПараметрыЗаполненияМакетов.Вставить("Организация",			ЭтотОбъект.Организация);
	ПараметрыЗаполненияМакетов.Вставить("ПредставлениеПериода", РаботаСБухгалтерскимиОтчетамиКлиентСервер.ПолучитьПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания));
	
#Область ПолучениеДанныхИзОтчётности
	Если ЭтотОбъект.ВариантОтчета = "Редакция20181217" Тогда
		ТаблицаСделок = Неопределено;
		
		ПараметрыРасчета = Новый Структура("Организация, Период");
		ЗаполнитьЗначенияСвойств(ПараметрыРасчета, ЭтотОбъект);
		
		ПараметрыЗаполненияМакетов.Вставить("ОбъемСделок", РаботаСОтчетностьюЦБ.ОКУД0420417_ПолучитьОбъемСделок(ПараметрыРасчета,, ТаблицаСделок) / 1000000); 
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПараметрыЗаполненияМакетов.Вставить("КоличествоКлиентов", РаботаСОтчетностьюЦБ.ОКУД0420418_ПолучитьКоличествоКлиентов(ЭтотОбъект, Запрос));
	
	Если ЭтотОбъект.ВариантОтчета = "Редакция20201216" Тогда
		ПараметрыЗаполненияМакетов.Вставить("СтоимостьИнвестиционныхПортфелей", РаботаСОтчетностьюЦБ.ОКУД0420418_ПолучитьСтоимостьПортфелей(ЭтотОбъект, Запрос) / 1000000000);
	КонецЕсли;
	
#КонецОбласти	

	Макет = ЭтотОбъект.ПолучитьМакет("Макет");

#Область Расшифровка

	Расшифровка = Новый ТабличныйДокумент;

	Если ЭтотОбъект.ВариантОтчета = "Редакция20181217" Тогда

		ОбластьРасшифровкаШапка		= Макет.ПолучитьОбласть("РасшифровкаШапка");
		ОбластьРасшифровкаСтрока	= Макет.ПолучитьОбласть("РасшифровкаСтрока");
		ОбластьРасшифровкаИтог		= Макет.ПолучитьОбласть("РасшифровкаИтог");
		
		ОбластьРасшифровкаШапка.Параметры.Расшифровка = "Расшифровка";
		Расшифровка.Вывести(ОбластьРасшифровкаШапка);
		
		НомерСтроки = 1;
		Для каждого СтрокаТаблицаСделок Из ТаблицаСделок Цикл
			ОбластьРасшифровкаСтрока.Параметры.Заполнить(СтрокаТаблицаСделок);
			ОбластьРасшифровкаСтрока.Параметры.НомерСтроки = НомерСтроки;
			НомерСтроки = НомерСтроки + 1;
			Расшифровка.Вывести(ОбластьРасшифровкаСтрока);
		КонецЦикла; 
		
		ОбластьРасшифровкаИтог.Параметры.Заполнить(ПараметрыЗаполненияМакетов);
		Расшифровка.Вывести(ОбластьРасшифровкаИтог);
		
		ПараметрыЗаполненияМакетов.Вставить("Расшифровка", Расшифровка);
		
	КонецЕсли;
#КонецОбласти
	
#Область Результат

	Результат = Новый ТабличныйДокумент;
	
	ОбластьОтчет = Макет.ПолучитьОбласть(ЭтотОбъект.ВариантОтчета);
	ОбластьОтчет.Параметры.Заполнить(ПараметрыЗаполненияМакетов);
	Результат.Вывести(ОбластьОтчет);
	
#КонецОбласти	

	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
	Возврат Результат;
	
КонецФункции
